Revit 2027 API
ElectricalSetting.CircuitRating Property
 The default circuit rating for newly created circuit.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CircuitRating { get; set; }
Public Property CircuitRating As Double
	Get
	Set
public:
property double CircuitRating {
	double get ();
	void set (double value);
}
member CircuitRating : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The circuit rating should be non-negative.
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace